DataProcessors/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМестаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/БольшаяЯчеистаяСборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>БольшаяЯчеистаяСборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКомплект</Name>
					<Comment>Данный Документ входит в комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТовараСЗоныОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробокПриПроверке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектБЯС</Name>
					<Comment>Документ комплект в котый входит данная сборка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коробки</Name>
					<Comment>Количество коробок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВСписке</Name>
					<Comment>Не показывать в списке НЕ РАСПРЕДЕЛЕННЫХ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаВАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогрузкаТоваровВАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшивкиРаспечатанны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыРаспечатаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списан</Name>
					<Comment>Списание товара с зоны отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМестХранений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплект</Name>
					<Comment>Данный Документ Является комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолПозиций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокБЯС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗонаОтгрузки/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.МестоОтгрузки="";
	ФФ=ФФПроверитьНаЗаполнение();
КонецПроцедуры
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	ФФ=ФФЗаписатьДокументRR();
КонецПроцедуры
&НаКлиенте
Функция ФФЗаписатьДокументRR()
	Если Объект.КолКоробок=0 тогда
		Сообщить ("Укажите количество коробок");
		Возврат 0;
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.МестоОтгрузки) тогда
		Сообщить ("Укажите место отгрузки");
		Возврат 0;
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.Док) тогда
		Сообщить ("Не выбран документ");
		Возврат 0;
	КонецЕсли;
	
//-------------------------------------------------------------//	
	Если Объект.Док.Коробки>0 Тогда
		Режим = РежимДиалогаВопрос.ОКОтмена;
		//Ответ=Вопрос("В документе уже есть места отгрузки. Вы хотите добавить или исправить? Если добавить нажмите ОК иначе ОТМЕНА",Режим,0);
		СписокКнопок=Новый СписокЗначений;
		СписокКнопок.Добавить("ИСПРАВИТЬ","ИСПРАВИТЬ");
		СписокКнопок.Добавить("ДОБАВИТЬ","ДОБАВИТЬ");
		СписокКнопок.Добавить("ОТМЕНА","ОТМЕНА");
		Ответ=Вопрос("В документе уже есть места отгрузки. Вы хотите исправить или добавить?", СписокКнопок,,"ОТМЕНА") ;
		Если Ответ = "ОТМЕНА" Тогда
			Возврат 0;
		КонецЕсли;
		
	иначе
		Сообщить("Коробок не может быть менше 1")
	КонецЕсли;
//-------------------------------------------------------------//	
	
	ФФЗаписатьДокументSS(Ответ);
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();

КонецФункции // ()
&НаСервере
Функция ФФЗаписатьДокументSS(ТипРедактирования)
	ОбъектДок=Объект.Док.ПолучитьОбъект();
	Если ТипРедактирования="ИСПРАВИТЬ" Тогда
		ОбъектДок.МестаОтгрузки.Очистить();	
	КонецЕсли;
	Стр=ОбъектДок.МестаОтгрузки.Добавить();
	
	Стр.КоличествоКоробок=Объект.КолКоробок;
	Стр.МестоОтгрузки=Объект.МестоОтгрузки;
	ОбъектДок.Коробки=ОбъектДок.МестаОтгрузки.Итог("КоличествоКоробок");
	ОбъектДок.Самовывоз=Объект.Самовывоз;
    ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции // ()
&НаКлиенте
Процедура ТДПриАктивизацииОбласти(Элемент)
	ТекЯчейка=Элемент.ТекущаяОбласть;
	БукваМХ=ТД.ПолучитьОбласть(1,ТекЯчейка.Лево).ТекущаяОбласть.Текст;
	ЦифраМХ=ТД.ПолучитьОбласть(ТекЯчейка.Верх,1).ТекущаяОбласть.Текст;
	МХ=БукваМХ + ЦифраМХ;
	ФФ=ФФТДПриАктивизацииОбласти(МХ)
КонецПроцедуры
&НаКлиенте
Функция ФФТДПриАктивизацииОбласти(МХ)
	Текущая=ТД.Область("Текущая");
	//Если МХ<>"" тогда
	//	ТекОбл=ТД.Область(МХ);
	//	//ТекОбл.ЦветФона=Текущая.ЦветФона;   
	//КонецЕсли;
	Объект.МестоОтгрузки=Справочники.МестаХранения.НайтиПоНаименованию(МХ);
КонецФункции 
&НаКлиенте
Функция ФФПроверитьНаЗаполнение();
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ЗонаОтгрузкиОстатки.НомерМестаОтгрузки,
	                 |	ЗонаОтгрузкиОстатки.ДокументПрихода,
	                 |	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток
	                 |ИЗ
	                 |	РегистрНакопления.ЗонаОтгрузки.Остатки КАК ЗонаОтгрузкиОстатки
	                 |ГДЕ
	                 |	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток > 0
	                 |	И ЗонаОтгрузкиОстатки.НомерМестаОтгрузки.Палет = ЛОЖЬ";
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  Макет=Обработки.ЗонаОтгрузки.ПолучитьМакет("Макет");
      ОТГРУЗКА=Макет.ПолучитьОбласть("ОТГРУЗКА");
	  ТД.Вывести(ОТГРУЗКА);
	  НФС=ТД.Область("НФС");
	  АСК=ТД.Область("АСК");
	  Пока Выборка.Следующий() Цикл 
		  МХ=СокрЛП(Выборка.НомерМестаОтгрузки.Наименование);
		  Если Лев(МХ,3)="сек" тогда
			  МХ=Лев(МХ,3)+Прав(МХ,1);
		  КонецЕсли; 
		  //Если Лев(МХ,1)="Ж" тогда
		  //	НЯ=Число(Прав(МХ,СтрДлина(МХ)-1));
		  //	Если  НЯ < 9 Тогда
		  //  	  МХ="Возврат";
		  //	Иначе
		  //  	  МХ="Аптека";
		  //	КонецЕсли;  
		  //КонецЕсли; 
		  ТекОбл=ТД.Область(МХ);
		  Коробок=ТД.Область(ТекОбл.Верх,ТекОбл.Лево);
		  Если Коробок.Текст <> "" тогда
			  ЧКоробок=Число(Коробок.Текст)+Выборка.КоличествоКоробокОстаток;
		  Иначе 
			  ЧКоробок=Выборка.КоличествоКоробокОстаток;
		  КонецЕсли;
		  Коробок.Текст=ЧКоробок;
		  Коробок.Примечание.Текст=Коробок.Примечание.Текст+Выборка.ДокументПрихода+Символы.ПС+"Счет-фактуры"+Выборка.ДокументПрихода.НомераСФ+" "+Выборка.КоличествоКоробокОстаток+" мест"+Символы.ПС+Символы.ПС;
		  Клиентов=ТД.Область(ТекОбл.Верх+1,ТекОбл.Лево);
		  
		  Если Клиентов.Текст <> "" тогда 
			  ЧКоробок=Число(Клиентов.Текст)+1;
		  Иначе 
			  ЧКоробок=1;
		  КонецЕсли;
		  Клиентов.Текст=ЧКоробок;
		  Клиентов.Примечание.Текст=Клиентов.Примечание.Текст+Выборка.ДокументПрихода.Получатель+" "+Выборка.КоличествоКоробокОстаток+" мест"+Символы.ПС;
		  Время=ТД.Область(ТекОбл.Верх+2,ТекОбл.Лево); 
		  Начало=Выборка.ДокументПрихода.НачалоОтгрузки;
			  Ч=Цел((ТекущаяДата()-Начало)/60/60);
			  М=Цел((ТекущаяДата()-Начало)/60)-Ч*60;
		  
		  Если Время.Текст<>"" тогда
			 ТекЧ=Число(Лев(Время.Текст,Найти(Время.Текст," ")-1)); 
			 Если Ч>ТекЧ тогда
				 
			 КонецЕсли;	 
		  Иначе
			  
		  КонецЕсли;	
		  
		 
			  ЧКоробок=Строка(Ч)+" ч. "+М+" м.";
		  Время.Текст=ЧКоробок;
		  Время.Примечание.Текст=Клиентов.Примечание.Текст+Выборка.ДокументПрихода.НачалоОтгрузки+Символы.ПС;
		  
		  Если Выборка.ДокументПрихода.Организация = "НФС" тогда
			  Если ТекОбл.ЦветФона=АСК.ЦветФона тогда
				  ТекОбл.ЦветФона=НФС.ЦветФона ;
				  Клиентов.ЦветФона=АСК.ЦветФона ;
			  Иначе
				  ТекОбл.ЦветФона=НФС.ЦветФона ;
			  КонецЕсли;
		  Иначе
			  Если ТекОбл.ЦветФона=НФС.ЦветФона тогда
				  ТекОбл.ЦветФона=АСК.ЦветФона ;
				  Клиентов.ЦветФона=НФС.ЦветФона ;
			  Иначе
				  ТекОбл.ЦветФона=АСК.ЦветФона ;
			  КонецЕсли;
			  ТекОбл.ЦветФона=АСК.ЦветФона ;
		  КонецЕсли;  
	  КонецЦикла;
КонецФункции 

&НаКлиенте
Процедура Обнавить(Команда)
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Лев(Данные, 12);	
		Если ЗначениеЗаполнено(ШК) Тогда
			Если ЗначениеЗаполнено(СокрЛП(ШК)) Тогда
				Если 12 = СтрДлина(ШК) Тогда
					//Если мВозврат Тогда
					//	НайтиДокументыПогрузки(ШК);
					//КонецЕсли;  
					Док = НайденыйДок(ШК,ложь);
					Объект.ШК=ШК ;
					Объект.Док=Док;
					Если НЕ ЗначениеЗаполнено(Док) Тогда
						ОчиститьСообщения();
						Объект.Самовывоз=Ложь;
						Сообщить("Документ не найден!!!");
					Иначе 
						//ОткрытьЗначение(Док);
						ОчиститьСообщения();
						Объект.Самовывоз=Объект.Док.Самовывоз;
						ПроверитьОстаткиПоКлиенту(Док);
					КонецЕсли;
				Иначе
					Сообщить("Не правильно введен штрих код!! Будьте внимательны при сканировании!");
				КонецЕсли;
			Иначе
				Сообщить("Введите Штрих Код!",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		ИначеЕсли Источник <> "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
			Сообщить("Сканер Штрих кода не подключен! Устраните неполадку!");		
		ИначеЕсли Источник = "СканерШтрихкода" И Событие = "Barcode" И НЕ ЗначениеЗаполнено(Данные) Тогда
			Сообщить("Сканер не может считать данные.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ПроверитьОстаткиПоКлиенту(Док)
	Текущая=ТД.Область("Текущая");
	Клиент=Док.Получатель;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗонаОтгрузкиОстатки.НомерМестаОтгрузки,
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток
		|ИЗ
		|	РегистрНакопления.ЗонаОтгрузки.Остатки(, ) КАК ЗонаОтгрузкиОстатки
		|ГДЕ
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток > 0
		|	И ЗонаОтгрузкиОстатки.ДокументПрихода.Получатель = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Клиент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
       Сообщить("ПОДСКАЗКА");
	   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		   Сообщить("Товар Клиента - "+Клиент+ " Лежит на месте - "+ВыборкаДетальныеЗаписи.НомерМестаОтгрузки+" коробок - "+ВыборкаДетальныеЗаписи.КоличествоКоробокОстаток);	
		   МХ=СокрЛП(ВыборкаДетальныеЗаписи.НомерМестаОтгрузки.Наименование);
		   Если Лев(МХ,3)="сек" тогда
			   МХ=Лев(МХ,3)+Прав(МХ,1);
		   КонецЕсли; 
		   //Если Лев(МХ,1)="Ж" тогда
		   //	НЯ=Число(Прав(МХ,СтрДлина(МХ)-1));
		   //	Если  НЯ < 9 Тогда
		   // 	   МХ="Возврат";
		   //	Иначе
		   // 	   МХ="Аптека";
		   //	КонецЕсли;  
		   //КонецЕсли; 
		   ТекОбл=ТД.Область(МХ);
		   ТекОбл.ЦветФона=Текущая.ЦветФона;
	   КонецЦикла;
   КонецПроцедуры
Функция НайденыйДок(Ном, мВозврат)
	//КодДокумента = ОбщийМодуль_Каштан.ПолучитьНомерДокументаПоШК(ШК);
	
	Если Ном = Неопределено тогда
		Сообщить("Документ не найден!!!");
		Возврат Неопределено;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка
		|ИЗ
		|	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
		|ГДЕ
		|	БольшаяЯчеистаяСборкаДокументыРасхода.ШК = &ШК";
		Запрос.УстановитьПараметр("ШК", Ном);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВозвратнаяСчетФактура.Ссылка
			|ИЗ
			|	Документ.ВозвратнаяСчетФактура КАК ВозвратнаяСчетФактура
			|ГДЕ
			|	ВозвратнаяСчетФактура.Количество > 0
			|	И ВозвратнаяСчетФактура.ШК = &ШК";
			Запрос.УстановитьПараметр("ШК", Ном);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				БС=Документы.БольшаяЯчеистаяСборка.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(БС,Выборка.Ссылка);
				БС.Дата=ТекущаяДата();
				БС.Номер="ВОЗ"+Сред(Выборка.Ссылка.Номер,4);
				
				БС.Город=Истина;
				БС.Комментарий=Выборка.Ссылка.Комментарий;
				БС.Направление=Справочники.Направление.НайтиПоКоду("100");
				БС.НомераСФ=Выборка.Ссылка.НомерСчетфактуры;
				БС.ОбщийВес=Выборка.Ссылка.Вес;
				БС.Возврат=Истина;
				БС.ОбщийОбъем=Выборка.Ссылка.Объем;
				БС.Организация=Выборка.Ссылка.Организация;
				БС.Ответственный=Выборка.Ссылка.Ответственный;
				БС.Получатель=Выборка.Ссылка.Контрагент;
				СтрБС=БС.ДокументыРасхода.Добавить();
				СтрБС.Док=Выборка.Ссылка;
				СтрБС.СчетФ=Выборка.Ссылка.НомерСчетфактуры;
				СтрБС.ШК=Выборка.Ссылка.ШК;
				СтрБС.ДокНомер=Выборка.Ссылка.Номер;
				СтрБС.ДатаДокумента=Выборка.Ссылка.Дата;
				СтрБС.Количество=Выборка.Ссылка.Количество;
				СтрБС.Сумма=Выборка.Ссылка.Сумма;
				СтрБС.КолПозиций=Выборка.Ссылка.КолПозиций;
				СтрБС.Объем=Выборка.Ссылка.Объем;
				СтрБС.Вес=Выборка.Ссылка.Вес;
Сообщить("СоздаюДокумент" + БС.Номер);
				БС.Записать(РежимЗаписиДокумента.Проведение);
				Возврат БС.Ссылка;
			Иначе	
				Возврат Неопределено;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();	
	Док = НайденыйДок(Объект.ШК, ложь);
	Объект.Док=Док;
	Если ЗначениеЗаполнено(Объект.Док) Тогда
		Объект.Самовывоз=Объект.Док.Самовывоз;	
	КонецЕсли;
	ПроверитьОстаткиПоКлиенту(Док);
КонецПроцедуры

&НаКлиенте
Процедура ДокПриИзменении(Элемент) 
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();	
	ПроверитьОстаткиПоКлиенту(Объект.Док);
КонецПроцедуры



&НаКлиенте
Процедура ПоказатьТоварНаЯчейке(Команда)
	ТекЯчейка=ТД.ТекущаяОбласть;
	БукваМХ=ТД.ПолучитьОбласть(ТекЯчейка.Верх,1).ТекущаяОбласть.Текст;
	ЦифраМХ=ТД.ПолучитьОбласть(1,ТекЯчейка.Лево).ТекущаяОбласть.Текст;
	Если ЦифраМХ="сек-" тогда
		БукваМХ=ТД.ПолучитьОбласть(ТекЯчейка.Верх,16).ТекущаяОбласть.Текст;
		МХ=ЦифраМХ + БукваМХ;
	Иначе	
		МХ=БукваМХ + ЦифраМХ;
	КонецЕсли;
	
	П=Новый Структура;
	П.Вставить("НаименованиеМестаОтгрузки",МХ);
	ОткрытьФорму("Обработка.ЗонаОтгрузки.Форма.ФормаТоварНаЯчейке",П);
	
  КонецПроцедуры

&НаКлиенте
  Процедура ПоказатьТоварВЗонеОтгрузки(Команда)
	  ОткрытьФорму("Обработка.ЗонаОтгрузки.Форма.ФормаТоварВЗонеОтгрузки");
  КонецПроцедуры
